zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_pwr.h
/**
  ******************************************************************************
  * @file    stm32mp13xx_ll_pwr.h
  * @author  MCD Application Team
  * @brief   Header file of PWR LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32MP13xx_LL_PWR_H
#define STM32MP13xx_LL_PWR_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32mp13xx.h"

/** @addtogroup STM32MP13xx_LL_Driver
  * @{
  */

#if defined(PWR)

/** @defgroup PWR_LL PWR
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @defgroup PWR_LL_Private_Constants PWR Private Constants
  * @{
  */

/** @defgroup PWR_LL_WAKEUP_PIN_OFFSET Wake-Up Pins register offsets Defines
  * @brief    Flags defines which can be used with LL_PWR_WriteReg function
  * @{
  */
/* Wake-Up Pins PWR register offsets */
#define LL_PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET    2UL
#define LL_PWR_WAKEUP_PINS_MAX_SHIFT_MASK       0x1FU
/**
  * @}
  */
/**
  * @}
  */
/* Private macros ------------------------------------------------------------*/
/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/** @defgroup PWR_LL_Exported_Constants PWR Exported Constants
  * @{
  */

/** @defgroup PWR_LL_EC_CLEAR_FLAG Clear Flags Defines
  * @brief    Flags defines which can be used with LL_PWR_WriteReg function
  * @{
  */
#define LL_PWR_FLAG_CPU_CSSF          PWR_MPUCR_CSSF      /*!< Clear MPU STANDBY, STOP flags */
#define LL_PWR_FLAG_WKUPCR_WKUPC1     PWR_WKUPCR_WKUPC1   /*!< Clear WKUP pin 1 */
#define LL_PWR_FLAG_WKUPCR_WKUPC2     PWR_WKUPCR_WKUPC2   /*!< Clear WKUP pin 2 */
#define LL_PWR_FLAG_WKUPCR_WKUPC3     PWR_WKUPCR_WKUPC3   /*!< Clear WKUP pin 3 */
#define LL_PWR_FLAG_WKUPCR_WKUPC4     PWR_WKUPCR_WKUPC4   /*!< Clear WKUP pin 4 */
#define LL_PWR_FLAG_WKUPCR_WKUPC5     PWR_WKUPCR_WKUPC5   /*!< Clear WKUP pin 5 */
#define LL_PWR_FLAG_WKUPCR_WKUPC6     PWR_WKUPCR_WKUPC6   /*!< Clear WKUP pin 6 */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_GET_FLAG Get Flags Defines
  * @brief    Flags defines which can be used with LL_PWR_ReadReg function
  * @{
  */
#define LL_PWR_FLAG_AVDO              PWR_CSR1_AVDO           /*!< Analog Voltage Detect Output */
#define LL_PWR_FLAG_PVDO              PWR_CSR1_PVDO           /*!< Power voltage detector output flag */

#define LL_PWR_FLAG_VBATL             PWR_CR2_VBATL           /*!< VBAT low threshold flag */
#define LL_PWR_FLAG_VBATH             PWR_CR2_VBATH           /*!< VBAT high threshold flag */
#define LL_PWR_FLAG_TEMPL             PWR_CR2_TEMPL           /*!< Temperature low threshold flag */
#define LL_PWR_FLAG_TEMPH             PWR_CR2_TEMPH           /*!< Temperature high threshold flag */

#define LL_PWR_FLAG_BRRDY             PWR_CR2_BRRDY           /*!< Backup Regulator ready flag */

#define LL_PWR_FLAG_VDDSD1RDY         PWR_CR3_VDDSD1RDY       /*!< VDDSD1 supply ready */
#define LL_PWR_FLAG_VDDSD2RDY         PWR_CR3_VDDSD2RDY       /*!< VDDSD2 supply ready */
#define LL_PWR_FLAG_USBRDY            PWR_CR3_USB33RDY        /*!< USB supply ready flag */
#define LL_PWR_FLAG_R18RDY            PWR_CR3_REG18RDY        /*!< 1V8 regulator supply ready */
#define LL_PWR_FLAG_R11RDY            PWR_CR3_REG11RDY        /*!< 1V1 regulator supply ready */


#define LL_PWR_WKUPFR_WKUPF1          PWR_WKUPFR_WKUPF1       /*!< Wakeup Pin Flag 1 */
#define LL_PWR_WKUPFR_WKUPF2          PWR_WKUPFR_WKUPF2       /*!< Wakeup Pin Flag 2 */
#define LL_PWR_WKUPFR_WKUPF3          PWR_WKUPFR_WKUPF3       /*!< Wakeup Pin Flag 3 */
#define LL_PWR_WKUPFR_WKUPF4          PWR_WKUPFR_WKUPF4       /*!< Wakeup Pin Flag 4 */
#define LL_PWR_WKUPFR_WKUPF5          PWR_WKUPFR_WKUPF5       /*!< Wakeup Pin Flag 5 */
#define LL_PWR_WKUPFR_WKUPF6          PWR_WKUPFR_WKUPF6       /*!< Wakeup Pin Flag 6 */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_MODE_PWR_DOWN_DSMODE Power Down Deep Sleep mode
  * @{
  */
#define LL_PWR_MPU_MODE_STOP        0x00000000U           /*!< Keep System STOP mode when MCU enters to CSTOP or keep System LPLV-Stop2 mode when MPU enters to CSTANBY */
#define LL_PWR_MPU_MODE_STANDBY     PWR_MPUCR_PDDS        /*!< Allow System STANDBY mode when MPU enters to CSTANBY */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_REGU_MODE_DS_MODE  External Regulator Stop Mode In Deep Sleep Mode
  * @{
  */
#define LL_PWR_REGU_DSMODE_MAIN           0x00000000U   /*!< External Voltage Regulator in main mode during deepsleep mode */
#define LL_PWR_REGU_DSMODE_LOW_POWER      PWR_CR1_LPDS  /*!< External Voltage Regulator in low-power stop mode during deepsleep mode */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_POWER_MODE_PIN_CONFIG  Power Mode Pin Configuration
  * @{
  */
#define LL_PWR_PIN_CONFIG_STANDBY         0x00000000U    /*!< Power mode pin configuration for standby mode */
#define LL_PWR_PIN_CONFIG_LOW_POWER       PWR_CR1_LPCFG  /*!< Power mode pin configuration for all low power modes */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_POWER_LOW_VOLTAGE_DS_MODE  Low Voltage Deep Sleep LPLV Stop mode
  * @{
  */
#define LL_PWR_LVDS_LPSTOP_MODE           0x00000000U   /*!< LP-Stop mode */
#define LL_PWR_LVDS_LPLVSTOP_MODE         PWR_CR1_LVDS  /*!< LPLV-Stop mode */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_POWER_STOP2_MODE  System Low Voltage Low Voltage Stop2 mode
  * @{
  */
#define LL_PWR_SYSTEM_STOP_MODE           0x00000000U    /*!< System Stop mode */
#define LL_PWR_SYSTEM_LPLVSTOP2_MODE      PWR_CR1_STOP2  /*!< System LPLV-Stop2 mode */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_PVDLEVEL Programmable Voltage Detector Level
  * @{
  */
#define LL_PWR_PVDLEVEL_0   PWR_CR1_PLS_LEV0  /*!< Voltage threshold detected by PVD 1.95 V */
#define LL_PWR_PVDLEVEL_1   PWR_CR1_PLS_LEV1  /*!< Voltage threshold detected by PVD 2.1 V  */
#define LL_PWR_PVDLEVEL_2   PWR_CR1_PLS_LEV2  /*!< Voltage threshold detected by PVD 2.25 V */
#define LL_PWR_PVDLEVEL_3   PWR_CR1_PLS_LEV3  /*!< Voltage threshold detected by PVD 2.4 V  */
#define LL_PWR_PVDLEVEL_4   PWR_CR1_PLS_LEV4  /*!< Voltage threshold detected by PVD 2.55 V */
#define LL_PWR_PVDLEVEL_5   PWR_CR1_PLS_LEV5  /*!< Voltage threshold detected by PVD 2.7 V  */
#define LL_PWR_PVDLEVEL_6   PWR_CR1_PLS_LEV6  /*!< Voltage threshold detected by PVD 2.85 V */
#define LL_PWR_PVDLEVEL_7   PWR_CR1_PLS_LEV7  /*!< External voltage level on PVD_IN pin, compared to internal VREFINT level. */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_AVDLEVEL Analog Voltage Detector Level
  * @{
  */
#define LL_PWR_AVDLEVEL_0   PWR_CR1_ALS_LEV0  /*!< Analog Voltage threshold detected by AVD 1.7 V */
#define LL_PWR_AVDLEVEL_1   PWR_CR1_ALS_LEV1  /*!< Analog Voltage threshold detected by AVD 2.1 V */
#define LL_PWR_AVDLEVEL_2   PWR_CR1_ALS_LEV2  /*!< Analog Voltage threshold detected by AVD 2.5 V */
#define LL_PWR_AVDLEVEL_3   PWR_CR1_ALS_LEV3  /*!< Analog Voltage threshold detected by AVD 2.8 V */

/**
  * @}
  */

