zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_pwr.h
/** @defgroup PWR_LL_EC_BATT_CHARG_RESISTOR VBAT charging resistor selection
  * @{
  */
#define LL_PWR_BATT_CHARG_RESISTOR_5K     0x00000000U   /*!< Charge VBAT through a 5 kO resistor  */
#define LL_PWR_BATT_CHARGRESISTOR_1_5K    PWR_CR3_VBRS  /*!< Charge VBAT through a 1.5 kO resistor  */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_WAKEUP_PIN  MPU Wakeup Pins
  * @{
  */
#define LL_PWR_WAKEUP_PIN1    PWR_MPUWKUPENR_WKUPEN1  /*!< Wake-Up pin 1 : PA0  */
#define LL_PWR_WAKEUP_PIN2    PWR_MPUWKUPENR_WKUPEN2  /*!< Wake-Up pin 2 : PA2  */
#define LL_PWR_WAKEUP_PIN3    PWR_MPUWKUPENR_WKUPEN3  /*!< Wake-Up pin 3 : PC1  */
#define LL_PWR_WAKEUP_PIN4    PWR_MPUWKUPENR_WKUPEN4  /*!< Wake-Up pin 4 : PC13 */
#define LL_PWR_WAKEUP_PIN5    PWR_MPUWKUPENR_WKUPEN5  /*!< Wake-Up pin 5 : PI8  */
#define LL_PWR_WAKEUP_PIN6    PWR_MPUWKUPENR_WKUPEN6  /*!< Wake-Up pin 6 : PI11 */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_WAKEUP_PIN_PULL  Wakeup Pins pull configuration
  * @{
  */
#define LL_PWR_WAKEUP_PIN_NOPULL      0x00000000UL   /*!< Configure Wake-Up pin in no pull */
#define LL_PWR_WAKEUP_PIN_PULLUP      0x00000001UL   /*!< Configure Wake-Up pin in pull Up */
#define LL_PWR_WAKEUP_PIN_PULLDOWN    0x00000002UL   /*!< Configure Wake-Up pin in pull Down */
/**
  * @}
  */

/**
  * @}
  */
/* Exported macro ------------------------------------------------------------*/
/** @defgroup PWR_LL_Exported_Macros PWR Exported Macros
  * @{
  */

/** @defgroup PWR_LL_EM_WRITE_READ Common write and read registers Macros
  * @{
  */

/**
  * @brief  Write a value in PWR register
  * @param  __REG__ Register to be written
  * @param  __VALUE__ Value to be written in the register
  * @retval None
  */
#define LL_PWR_WriteReg(__REG__, __VALUE__) WRITE_REG(PWR->__REG__, (__VALUE__))

/**
  * @brief  Read a value in PWR register
  * @param  __REG__ Register to be read
  * @retval Register value
  */
#define LL_PWR_ReadReg(__REG__) READ_REG(PWR->__REG__)
/**
  * @}
  */

/**
  * @}
  */
/* Exported functions --------------------------------------------------------*/
/** @defgroup PWR_LL_Exported_Functions PWR Exported Functions
  * @{
  */

/** @defgroup PWR_LL_EF_Configuration Configuration
  * @{
  */

/**
  * @brief  Set the voltage Regulator mode during deep sleep mode
  * @rmtoll CR1    LPDS         LL_PWR_SetRegulModeDS
  * @param  RegulMode This parameter can be one of the following values:
  *         @arg @ref LL_PWR_REGU_DSMODE_MAIN
  *         @arg @ref LL_PWR_REGU_DSMODE_LOW_POWER
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetRegulModeDS(uint32_t RegulMode)
{
  MODIFY_REG(PWR->CR1, PWR_CR1_LPDS, RegulMode);
}

/**
  * @brief  Get the voltage Regulator mode during deep sleep mode
  * @rmtoll CR1    LPDS         LL_PWR_GetRegulModeDS
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_REGU_DSMODE_MAIN
  *         @arg @ref LL_PWR_REGU_DSMODE_LOW_POWER
  */
__STATIC_INLINE uint32_t LL_PWR_GetRegulModeDS(void)
{
  return (uint32_t)(READ_BIT(PWR->CR1, PWR_CR1_LPDS));
}

/**
  * @brief  Set the low power pin configuration
  * @rmtoll CR1    LPCFG         LL_PWR_SetPwrPinConfig
  * @param  PwrPinMode This parameter can be one of the following values:
  *         @arg @ref LL_PWR_PIN_CONFIG_STANDBY
  *         @arg @ref LL_PWR_PIN_CONFIG_LOW_POWER
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetPwrPinConfig(uint32_t PwrPinMode)
{
  MODIFY_REG(PWR->CR1, PWR_CR1_LPCFG, PwrPinMode);
}

/**
  * @brief  Get the low power pin configuration
  * @rmtoll CR1    LPCFG        LL_PWR_GetPwrPinConfig
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_PIN_CONFIG_STANDBY
  *         @arg @ref LL_PWR_PIN_CONFIG_LOW_POWER
  */
__STATIC_INLINE uint32_t LL_PWR_GetPwrPinConfig(void)
{
  return (uint32_t)(READ_BIT(PWR->CR1, PWR_CR1_LPCFG));
}

/**
  * @brief  Set the low voltage deep sleep LPLV stop mode
  * @rmtoll CR1    LVDS         LL_PWR_SetLVDSStopMode
  * @param  StopMode This parameter can be one of the following values:
  *         @arg @ref LL_PWR_LVDS_LPSTOP_MODE
  *         @arg @ref LL_PWR_LVDS_LPLVSTOP_MODE
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetLVDSStopMode(uint32_t StopMode)
{
  MODIFY_REG(PWR->CR1, PWR_CR1_LVDS, StopMode);
}

/**
  * @brief  Get the low voltage deep sleep LPLV stop mode
  * @rmtoll CR1    LVDS         LL_PWR_GetLVDSStopMode
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_LVDS_LPSTOP_MODE
  *         @arg @ref LL_PWR_LVDS_LPLVSTOP_MODE
  */
__STATIC_INLINE uint32_t LL_PWR_GetLVDSStopMode(void)
{
  return (uint32_t)(READ_BIT(PWR->CR1, PWR_CR1_LVDS));
}

/**
  * @brief  Set the system LPLV stop2 mode
  * @rmtoll CR1    STOP2         LL_PWR_SetLPLVStop2Mode
  * @param  Stop2Mode This parameter can be one of the following values:
  *         @arg @ref LL_PWR_SYSTEM_STOP_MODE
  *         @arg @ref LL_PWR_SYSTEM_LPLVSTOP2_MODE
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetLPLVStop2Mode(uint32_t Stop2Mode)
{
  MODIFY_REG(PWR->CR1, PWR_CR1_STOP2, Stop2Mode);
}

/**
  * @brief  Get the system LPLV stop2 mode
  * @rmtoll CR1    STOP2         LL_PWR_GetLPLVStop2Mode
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_SYSTEM_STOP_MODE
  *         @arg @ref LL_PWR_SYSTEM_LPLVSTOP2_MODE
  */
__STATIC_INLINE uint32_t LL_PWR_GetLPLVStop2Mode(void)
{
  return (uint32_t)(READ_BIT(PWR->CR1, PWR_CR1_STOP2));
}

/**
  * @brief  Enable Programmable Voltage Detector
  * @rmtoll CR1    PVDEN       LL_PWR_EnablePVD
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnablePVD(void)
{
  SET_BIT(PWR->CR1, PWR_CR1_PVDEN);
}

/**
  * @brief  Disable Programmable Voltage Detector
  * @rmtoll CR1    PVDEN       LL_PWR_DisablePVD
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisablePVD(void)
{
  CLEAR_BIT(PWR->CR1, PWR_CR1_PVDEN);
}

/**
  * @brief  Check if Programmable Voltage Detector is enabled
  * @rmtoll CR1    PVDEN       LL_PWR_IsEnabledPVD
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledPVD(void)
{
  return ((READ_BIT(PWR->CR1, PWR_CR1_PVDEN) == (PWR_CR1_PVDEN)) ? 1UL : 0UL);
}

/**
  * @brief  Configure the voltage threshold detected by the Programmable Voltage Detector
  * @rmtoll CR1    PLS       LL_PWR_SetPVDLevel
  * @param  PVDLevel This parameter can be one of the following values:
  *         @arg @ref LL_PWR_PVDLEVEL_0
  *         @arg @ref LL_PWR_PVDLEVEL_1
  *         @arg @ref LL_PWR_PVDLEVEL_2
  *         @arg @ref LL_PWR_PVDLEVEL_3
  *         @arg @ref LL_PWR_PVDLEVEL_4
  *         @arg @ref LL_PWR_PVDLEVEL_5
  *         @arg @ref LL_PWR_PVDLEVEL_6
  *         @arg @ref LL_PWR_PVDLEVEL_7
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetPVDLevel(uint32_t PVDLevel)
{
  MODIFY_REG(PWR->CR1, PWR_CR1_PLS, PVDLevel);
}

/**
  * @brief  Get the voltage threshold detection
  * @rmtoll CR1    PLS       LL_PWR_GetPVDLevel
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_PVDLEVEL_0
  *         @arg @ref LL_PWR_PVDLEVEL_1
  *         @arg @ref LL_PWR_PVDLEVEL_2
  *         @arg @ref LL_PWR_PVDLEVEL_3
  *         @arg @ref LL_PWR_PVDLEVEL_4
  *         @arg @ref LL_PWR_PVDLEVEL_5
  *         @arg @ref LL_PWR_PVDLEVEL_6
  *         @arg @ref LL_PWR_PVDLEVEL_7
  */
__STATIC_INLINE uint32_t LL_PWR_GetPVDLevel(void)
{
  return (uint32_t)(READ_BIT(PWR->CR1, PWR_CR1_PLS));
}

/**
  * @brief  Enable access to the backup domain
  * @rmtoll CR1    DBP       LL_PWR_EnableBkUpAccess
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableBkUpAccess(void)
{
  SET_BIT(PWR->CR1, PWR_CR1_DBP);
}

/**
  * @brief  Disable access to the backup domain
  * @rmtoll CR1    DBP       LL_PWR_DisableBkUpAccess
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableBkUpAccess(void)
{
  CLEAR_BIT(PWR->CR1, PWR_CR1_DBP);
}

/**
  * @brief  Check if the backup domain is enabled
  * @rmtoll CR1    DBP       LL_PWR_IsEnabledBkUpAccess
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledBkUpAccess(void)
{
  return ((READ_BIT(PWR->CR1, PWR_CR1_DBP) == (PWR_CR1_DBP)) ? 1UL : 0UL);
}

/**
  * @brief  Enable MPU memories low speed
  * @rmtoll CR1    MPU_RAM_LOWSPEED       LL_PWR_EnableMpuRamLowSpeed
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableMpuRamLowSpeed(void)
{
  SET_BIT(PWR->CR1, PWR_CR1_MPU_RAM_LOWSPEED);
}

/**
  * @brief  Disable MPU memories low speed
  * @rmtoll CR1    MPU_RAM_LOWSPEED       LL_PWR_DisableMpuRamLowSpeed
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableMpuRamLowSpeed(void)
{
  CLEAR_BIT(PWR->CR1, PWR_CR1_MPU_RAM_LOWSPEED);
}

/**
  * @brief  Check if MPU memories low speed is enabled
  * @rmtoll CR1    MPU_RAM_LOWSPEED       LL_PWR_IsEnabledMpuRamLowSpeed
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledMpuRamLowSpeed(void)
{
  return ((READ_BIT(PWR->CR1, PWR_CR1_MPU_RAM_LOWSPEED) == (PWR_CR1_MPU_RAM_LOWSPEED)) ? 1UL : 0UL);
}

/**
  * @brief  Enable Analog Power Voltage Detector
  * @rmtoll CR1    AVDEN       LL_PWR_EnableAVD
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableAVD(void)
{
  SET_BIT(PWR->CR1, PWR_CR1_AVDEN);
}

/**
  * @brief  Disable Analog Power Voltage Detector
  * @rmtoll CR1    AVDEN       LL_PWR_DisableAVD
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableAVD(void)
{
  CLEAR_BIT(PWR->CR1, PWR_CR1_AVDEN);
}

/**
  * @brief  Check if Analog Power Voltage Detector is enabled
  * @rmtoll CR1    AVDEN       LL_PWR_IsEnabledAVD
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledAVD(void)
{
  return ((READ_BIT(PWR->CR1, PWR_CR1_AVDEN) == (PWR_CR1_AVDEN)) ? 1UL : 0UL);
}

/**
  * @brief  Configure the voltage threshold to be detected by the Analog Power Voltage Detector
  * @rmtoll CR1    ALS       LL_PWR_SetAVDLevel
  * @param  AVDLevel This parameter can be one of the following values:
  *         @arg @ref LL_PWR_AVDLEVEL_0
  *         @arg @ref LL_PWR_AVDLEVEL_1
  *         @arg @ref LL_PWR_AVDLEVEL_2
  *         @arg @ref LL_PWR_AVDLEVEL_3
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetAVDLevel(uint32_t AVDLevel)
{
  MODIFY_REG(PWR->CR1, PWR_CR1_ALS, AVDLevel);
}

/**
  * @brief  Get the Analog Voltage threshold to be detected by the Analog Power Voltage Detector
  * @rmtoll CR1    ALS       LL_PWR_GetAVDLevel
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_AVDLEVEL_0
  *         @arg @ref LL_PWR_AVDLEVEL_1
  *         @arg @ref LL_PWR_AVDLEVEL_2
  *         @arg @ref LL_PWR_AVDLEVEL_3
  */
__STATIC_INLINE uint32_t LL_PWR_GetAVDLevel(void)
{
  return (uint32_t)(READ_BIT(PWR->CR1, PWR_CR1_ALS));
}

/**
  * @brief  Enable Backup Regulator
  * @rmtoll CR2    BREN       LL_PWR_EnableBkUpRegulator
  * @note When set, the Backup Regulator (used to maintain backup SRAM content
  *       in Standby and VBAT modes) is enabled. If BRE is reset, the backup
  *       Regulator is switched off. The backup SRAM can still be used in Run
  *       mode and Stop mode but its content will be lost in the Standby and VBAT
  *       modes. Once set, the application must wait that the Backup Regulator
  *       Ready flag (BRR) is set to indicate that the data written into the RAM
  *       will be maintained in the Standby and VBAT modes.
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableBkUpRegulator(void)
{
  SET_BIT(PWR->CR2, PWR_CR2_BREN);
}

/**
  * @brief  Disable Backup Regulator
  * @rmtoll CR2    BREN       LL_PWR_DisableBkUpRegulator
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableBkUpRegulator(void)
{
  CLEAR_BIT(PWR->CR2, PWR_CR2_BREN);
}

/**
  * @brief  Check if the backup Regulator is enabled
  * @rmtoll CR2    BREN      LL_PWR_IsEnabledBkUpRegulator
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledBkUpRegulator(void)
{
  return ((READ_BIT(PWR->CR2, PWR_CR2_BREN) == (PWR_CR2_BREN)) ? 1UL : 0UL);
}


/**
  * @brief  Enable VBAT and Temperature monitoring
  * @rmtoll CR2    MONEN       LL_PWR_EnableMonitoring
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableMonitoring(void)
{
  SET_BIT(PWR->CR2, PWR_CR2_MONEN);
}

/**
  * @brief  Disable VBAT and Temperature monitoring
  * @rmtoll CR2    MONEN       LL_PWR_DisableMonitoring
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableMonitoring(void)
{
  CLEAR_BIT(PWR->CR2, PWR_CR2_MONEN);
}

/**
  * @brief  Check if the VBAT and Temperature monitoring is enabled
  * @rmtoll CR2    MONEN      LL_PWR_IsEnabledMonitoring
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledMonitoring(void)
{
  return ((READ_BIT(PWR->CR2, PWR_CR2_MONEN) == (PWR_CR2_MONEN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable battery charging
  * @rmtoll CR3          VBE           LL_PWR_EnableBatteryCharging
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableBatteryCharging(void)
{
  SET_BIT(PWR->CR3, PWR_CR3_VBE);
}

/**
  * @brief  Disable battery charging
  * @rmtoll CR3          VBE           LL_PWR_DisableBatteryCharging
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableBatteryCharging(void)
{
  CLEAR_BIT(PWR->CR3, PWR_CR3_VBE);
}

/**
  * @brief  Check if battery charging is enabled
  * @rmtoll CR3          VBE           LL_PWR_IsEnabledBatteryCharging
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledBatteryCharging(void)
{
  return ((READ_BIT(PWR->CR3, PWR_CR3_VBE) == (PWR_CR3_VBE)) ? 1UL : 0UL);
}

/**
  * @brief  Set the Battery charge resistor impedance
  * @rmtoll CR3          VBRS          LL_PWR_SetBattChargResistor
  * @param  Resistor This parameter can be one of the following values:
  *         @arg @ref LL_PWR_BATT_CHARG_RESISTOR_5K
  *         @arg @ref LL_PWR_BATT_CHARGRESISTOR_1_5K
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetBattChargResistor(uint32_t Resistor)
{
  MODIFY_REG(PWR->CR3, PWR_CR3_VBRS, Resistor);
}

/**
  * @brief  Get the Battery charge resistor impedance
  * @rmtoll CR3          VBRS          LL_PWR_GetBattChargResistor
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_BATT_CHARG_RESISTOR_5K
  *         @arg @ref LL_PWR_BATT_CHARGRESISTOR_1_5K
  */
__STATIC_INLINE uint32_t LL_PWR_GetBattChargResistor(void)
{
  return (uint32_t)(READ_BIT(PWR->CR3, PWR_CR3_VBRS));
}

/**
  * @brief  Enable the ddr self-refresh in standby mode
  * @rmtoll CR3          DDRSREN           LL_PWR_EnableDdrSelfRefresh
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableDdrSelfRefresh(void)
{
  SET_BIT(PWR->CR3, PWR_CR3_DDRSREN);
}

/**
  * @brief  Disable the ddr self-refresh in standby mode
  * @rmtoll CR3          DDRSREN           LL_PWR_DisableDdrSelfRefresh
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableDdrSelfRefresh(void)
{
  CLEAR_BIT(PWR->CR3, PWR_CR3_DDRSREN);
}

/**
  * @brief  Check if the ddr self-refresh in standby mode is enabled
  * @rmtoll CR3          DDRSREN           LL_PWR_IsEnabledDdrSelfRefresh
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledDdrSelfRefresh(void)
{
  return ((READ_BIT(PWR->CR3, PWR_CR3_DDRSREN) == (PWR_CR3_DDRSREN)) ? 1UL : 0UL);
}

/**
  * @brief  Disable the ddr self-refresh retention after standby mode
  * @rmtoll CR3          DDRSRDIS           LL_PWR_DisableDdrSelfRefreshRetention
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableDdrSelfRefreshRetention(void)
{
  SET_BIT(PWR->CR3, PWR_CR3_DDRSRDIS);
}

/**
  * @brief  Check if the ddr self-refresh retention after standby mode is enabled
  * @rmtoll CR3          DDRSRDIS           LL_PWR_IsEnabledDdrSelfRefreshRetention
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledDdrSelfRefreshRetention(void)
{
  return ((READ_BIT(PWR->CR3, PWR_CR3_DDRSRDIS) == (PWR_CR3_DDRSRDIS)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the ddr retention
  * @rmtoll CR3          DDRRETEN           LL_PWR_EnableDdrRetention
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableDdrRetention(void)
{
  SET_BIT(PWR->CR3, PWR_CR3_DDRRETEN);
}

/**
  * @brief  Disable the ddr retention
  * @rmtoll CR3          DDRRETEN           LL_PWR_DisableDdrRetention
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableDdrRetention(void)
{
  CLEAR_BIT(PWR->CR3, PWR_CR3_DDRRETEN);
}

/**
  * @brief  Check if the ddr retention is enabled
  * @rmtoll CR3          DDRRETEN           LL_PWR_IsEnabledDdrRetention
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledDdrRetention(void)
{
  return ((READ_BIT(PWR->CR3, PWR_CR3_DDRRETEN) == (PWR_CR3_DDRRETEN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the VDDSD1 voltage level detector
  * @rmtoll CR3          VDDSD1DEN           LL_PWR_EnableVDDSD1VoltageDetector
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableVDDSD1VoltageDetector(void)
{
  SET_BIT(PWR->CR3, PWR_CR3_VDDSD1DEN);
}

/**
  * @brief  Disable the VDDSD1 voltage level detector
  * @rmtoll CR3          VDDSD1DEN           LL_PWR_DisableVDDSD1VoltageDetector
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableVDDSD1VoltageDetector(void)
{
  CLEAR_BIT(PWR->CR3, PWR_CR3_VDDSD1DEN);
}

/**
  * @brief  Check if the VDDSD1 voltage level detector is enabled
  * @rmtoll CR3          VDDSD1DEN           LL_PWR_IsEnabledVDDSD1VoltageDetector
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledVDDSD1VoltageDetector(void)
{
  return ((READ_BIT(PWR->CR3, PWR_CR3_VDDSD1DEN) == (PWR_CR3_VDDSD1DEN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the VDDSD2 voltage level detector
  * @rmtoll CR3          VDDSD2DEN           LL_PWR_EnableVDDSD2VoltageDetector
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableVDDSD2VoltageDetector(void)
{
  SET_BIT(PWR->CR3, PWR_CR3_VDDSD2DEN);
}

/**
  * @brief  Disable the VDDSD2 voltage level detector
  * @rmtoll CR3          VDDSD2DEN           LL_PWR_DisableVDDSD2VoltageDetector
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableVDDSD2VoltageDetector(void)
{
  CLEAR_BIT(PWR->CR3, PWR_CR3_VDDSD2DEN);
}

/**
  * @brief  Check if the VDDSD2 voltage level detector is enabled
  * @rmtoll CR3          VDDSD2DEN           LL_PWR_IsEnabledVDDSD2VoltageDetector
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledVDDSD2VoltageDetector(void)
{
  return ((READ_BIT(PWR->CR3, PWR_CR3_VDDSD2DEN) == (PWR_CR3_VDDSD2DEN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the VDDSD1 override voltage level detector
  * @rmtoll CR3          VDDSD1VALID           LL_PWR_EnableVDDSD1OverrideVoltageDetector
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableVDDSD1OverrideVoltageDetector(void)
{
  SET_BIT(PWR->CR3, PWR_CR3_VDDSD1VALID);
}

/**
  * @brief  Disable the VDDSD1 override voltage level detector
  * @rmtoll CR3          VDDSD1VALID           LL_PWR_DisableVDDSD1OverrideVoltageDetector
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableVDDSD1OverrideVoltageDetector(void)
{
  CLEAR_BIT(PWR->CR3, PWR_CR3_VDDSD1VALID);
}

/**
  * @brief  Check if the VDDSD1 override voltage level detector is enabled
  * @rmtoll CR3          VDDSD1VALID           LL_PWR_IsEnabledVDDSD1OverrideVoltageDetector
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledVDDSD1OverrideVoltageDetector(void)
{
  return ((READ_BIT(PWR->CR3, PWR_CR3_VDDSD1VALID) == (PWR_CR3_VDDSD1VALID)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the VDDSD2 override voltage level detector
  * @rmtoll CR3          VDDSD2VALID           LL_PWR_EnableVDDSD2OverrideVoltageDetector
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableVDDSD2OverrideVoltageDetector(void)
{
  SET_BIT(PWR->CR3, PWR_CR3_VDDSD2VALID);
}

/**
  * @brief  Disable the VDDSD2 override voltage level detector
  * @rmtoll CR3          VDDSD2VALID           LL_PWR_DisableVDDSD2OverrideVoltageDetector
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableVDDSD2OverrideVoltageDetector(void)
{
  CLEAR_BIT(PWR->CR3, PWR_CR3_VDDSD2VALID);
}

/**
  * @brief  Check if the VDDSD2 override voltage level detector is enabled
  * @rmtoll CR3          VDDSD2VALID           LL_PWR_IsEnabledVDDSD2OverrideVoltageDetector
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledVDDSD2OverrideVoltageDetector(void)
{
  return ((READ_BIT(PWR->CR3, PWR_CR3_VDDSD2VALID) == (PWR_CR3_VDDSD2VALID)) ? 1UL : 0UL);
}


/**
  * @brief  Enable 1V1 regulator
  * @rmtoll CR3          REG11EN           LL_PWR_Enable1V1Regulator
  * @retval None
  */
__STATIC_INLINE void LL_PWR_Enable1V1Regulator(void)
{
  SET_BIT(PWR->CR3, PWR_CR3_REG11EN);
}

/**
  * @brief  Disable the 1V1 regulator
  * @rmtoll CR3          REG11EN           LL_PWR_Disable1V1Regulator
  * @retval None
  */
__STATIC_INLINE void LL_PWR_Disable1V1Regulator(void)
{
  CLEAR_BIT(PWR->CR3, PWR_CR3_REG11EN);
}

/**
  * @brief  Check if the 1V1 regulator is enabled
  * @rmtoll CR3          REG11EN           LL_PWR_IsEnabled1V1Regulator
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabled1V1Regulator(void)
{
  return ((READ_BIT(PWR->CR3, PWR_CR3_REG11EN) == (PWR_CR3_REG11EN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable 1V8 regulator
  * @rmtoll CR3          REG18EN           LL_PWR_Enable1V8Regulator
  * @retval None
  */
__STATIC_INLINE void LL_PWR_Enable1V8Regulator(void)
{
  SET_BIT(PWR->CR3, PWR_CR3_REG18EN);
}

/**
  * @brief  Disable the 1V8 regulator
  * @rmtoll CR3          REG18EN           LL_PWR_Disable1V8Regulator
  * @retval None
  */
__STATIC_INLINE void LL_PWR_Disable1V8Regulator(void)
{
  CLEAR_BIT(PWR->CR3, PWR_CR3_REG18EN);
}

/**
  * @brief  Check if the 1V8 regulator is enabled
  * @rmtoll CR3          REG18EN           LL_PWR_IsEnabled1V8Regulator
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabled1V8Regulator(void)
{
  return ((READ_BIT(PWR->CR3, PWR_CR3_REG18EN) == (PWR_CR3_REG18EN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the USB voltage detector
  * @rmtoll CR3          USB33DEN           LL_PWR_EnableUSBVoltageDetector
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableUSBVoltageDetector(void)
{
  SET_BIT(PWR->CR3, PWR_CR3_USB33DEN);
}

/**
  * @brief  Disable the USB voltage detector
  * @rmtoll CR3          USB33DEN           LL_PWR_DisableUSBVoltageDetector
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableUSBVoltageDetector(void)
{
  CLEAR_BIT(PWR->CR3, PWR_CR3_USB33DEN);
}

/**
  * @brief  Check if the USB voltage detector is enabled
  * @rmtoll CR3          USB33DEN           LL_PWR_IsEnabledUSBVoltageDetector
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledUSBVoltageDetector(void)
{
  return ((READ_BIT(PWR->CR3, PWR_CR3_USB33DEN) == (PWR_CR3_USB33DEN)) ? 1UL : 0UL);
}


/**
  * @brief  Set the power down mode when MPU enters enters deepsleep
  * @rmtoll MPUCR     PDDS       LL_PWR_MPU_SetPowerMode\n
  * @param  PDMode This parameter can be one of the following values:
  *         @arg @ref LL_PWR_MPU_MODE_STOP
  *         @arg @ref LL_PWR_MPU_MODE_STANDBY
  * @retval None
  */
__STATIC_INLINE void LL_PWR_MPU_SetPowerMode(uint32_t PDMode)
{
  MODIFY_REG(PWR->MPUCR, PWR_MPUCR_PDDS, PDMode);
}

/**
  * @brief  Get the power down mode when MPU enters enters deepsleep
  * @rmtoll MPUCR     PDDS       LL_PWR_MPU_GetPowerMode\n
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_MPU_MODE_STOP
  *         @arg @ref LL_PWR_MPU_MODE_STANDBY
  */
__STATIC_INLINE uint32_t LL_PWR_MCU_GetPowerMode(void)
{
  return (uint32_t)(READ_BIT(PWR->MPUCR, PWR_MPUCR_PDDS));
}

